---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoCurtainRoofsInMassing
source: html/cd995395-8169-3d87-6564-acd711c91378.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MassFailures.NoCurtainRoofsInMassing Property

Massing cannot be created with a curtain roof. Please change the default roof type and try again.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoCurtainRoofsInMassing { get; }
```